import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

df_init = pd.DataFrame({
	'ТЭС': ['Сургутская ГРЭС-2', 'Рефтинская ГРЭС', 'Костромская ГРЭС',
			'Сургутская ГРЭС-1', 'Рязанская ГРЭС', 'Киришская ГРЭС'],
	'Владелец': ['Э.Он Россия', 'Энел Россия', 'Интер РАО', 'Газпром энергохолдинг',
				 'Газпром энергохолдинг', 'Газпром энергохолдинг'],
	'Регион': ['Ханты-Мансийский АО', 'Свердловская область', 'Костромская область',
			   'Ханты-Мансийский АО', 'Рязанская область', 'Ленинградская область'],
	'Мощность (ГВт)': [5.6, 3.8, 3.3, 3.3, 3.3, 2.6],
})

df_init.head()

df_sort = df_init.sort_values(['Мощность (ГВт)'])
print(df_sort)
print()

df_exted = pd.concat([df_init, pd.DataFrame({
	'ТЭС': ['Конаковская ГРЭС', 'Ириклинская ГРЭС', 'Пермская ГРЭС', 'Ставропольская ГРЭС'],
	'Владелец': ['Энел Россия', 'Интер РАО', 'Интер РАО', 'Газпром энергохолдинг'],
	'Регион': ['Тверская область', 'Оренбургская область', 'Пермский край', 'Ставропольский край'],
	'Мощность (ГВт)': [2.5, 2.4, 2.4, 2.4]})], ignore_index=True)

df_exted['выработка_за_сутки'] = df_exted['Мощность (ГВт)'] * 24
print(df_exted)
print()

df_exted_2 = df_exted.copy()
print(df_exted_2[df_exted_2['Регион'] == 'Ханты-Мансийский АО'])
print()

df_exted_2['ТЭС'] = np.where(df_exted_2['Владелец'].str.find('Газпром') >= 0,
							 'Газпром энергохолдинг', np.where(df_exted_2['Владелец'].str.find('Интер') >= 0,
															   'Интер РАО', 'Остальные'))

df_exted_2['Мощность (ГВт)'].plot(y='ТЭС', style='o')
plt.show()

df_exted_2.groupby(['ТЭС'])['Мощность (ГВт)'].sum().plot(kind='barh')
plt.show()

a = df_exted.groupby(['Регион'])['ТЭС'].count().plot(kind='pie')
plt.show()
print()